Repository: VadymBezsmertnyi/motorcycle-models-encyclopedia
Catalog: localization/*/messages.po
Languages: uk

source: Searching for a motorcycle brand or model
uk: Пошук марки або моделі мотоцикла

source: Displayed {amountShowMotorcycles} motorcycles out of {amountAllMotorcycles}
uk: Показано {amountShowMotorcycles} мотоциклів з {amountAllMotorcycles}

source: Button for closing the modal window
uk: Кнопка для закриття модального вікна

source: Background overlay for closing the modal window
uk: Фоновий налив для закриття модального вікна

source: Brand
uk: Марка

source: Model
uk: Модель

source: Year
uk: Рік

source: Style
uk: Стиль

source: Favorites
uk: Улюблені

source: No data available
uk: Дані відсутні

source: Search {brand} {model}
uk: Пошук {brand} {model}

source: year the motorcycle was built
uk: рік виготовлення мотоцикла

source: Category
uk: Категорія

source: sub-class of motorcycle in the market (style)
uk: підклас мотоцикла на ринку (стиль)

source: Rating
uk: Рейтинг

source: review average out of 5 stars
uk: середній рейтинг з 5 зірок

source: Displacement (ccm)
uk: Об'єм (куб. см)

source: engine size of the motorcycle in cubic centimeters (ccm)
uk: об'єм двигуна мотоцикла у кубічних сантиметрах (куб. см)

source: Power (hp)
uk: Потужність (к.с.)

source: max power output in horsepower (hp)
uk: максимальна потужність у кінських силах (к.с.)

source: Torque (Nm)
uk: Крутний момент (Нм)

source: max torque in newton-meters (Nm)
uk: максимальний крутний момент у ньютон-метрах (Нм)

source: Engine cylinder
uk: Кількість циліндрів двигуна

source: number of cylinders in the engine as well as configuration
uk: кількість циліндрів у двигуні, а також його конфігурація

source: Engine stroke
uk: Хід двигуна

source: number of stages to complete one power stroke of the engine
uk: кількість етапів для завершення одного робочого ходу двигуна

source: Transmission type
uk: Тип трансмісії

source: Types include: hydraulic automatic transmission, continuously variable transmission, and dual-clutch automatic transmissions
uk: Типи включають: гідравлічну автоматичну трансмісію, безступінчасту трансмісію та двоспособову автоматичну трансмісію

source: Find detailed information on the internet
uk: Знайдіть детальну інформацію в Інтернеті

source: Years min: {min}, max: {max}
uk: Мінімум роки: {min}, максимум: {max}

source: Filter
uk: Фільтр

source: Brands:
uk: Бренди:

source: Enter brand
uk: Введіть бренд

source: Selected brands({amountSelectedBrands})
uk: Обрані бренди ({amountSelectedBrands})

source: Years:
uk: Роки:

source: - to -
uk: - до -

source: Min: {min}, max: {max}
uk: Мінімум: {min}, максимум: {max}

source: Categories:
uk: Категорії:

source: Reset
uk: Скинути

source: Save
uk: Зберегти

source: Settings
uk: Налаштування

source: Language
uk: Мова

source: Change to {changeLanguage}
uk: Змінити на {changeLanguage}

source: Error key token: Secret key is not defined in the environment variables
uk: Помилка ключа токена: Секретний ключ не визначений у змінних середовища

source: Error: Invalid phone number or password
uk: Помилка: Недійсний номер телефону або пароль

source: Error: Invalid token
uk: Помилка: Недійсний токен

source: Error: Token expired
uk: Помилка: Токен закінчився

source: Error: User already exists
uk: Помилка: Користувач вже існує

source: Error: User not found
uk: Помилка: Користувача не знайдено

source: Internal Server Error
uk: Внутрішня серверна помилка
